{
  "promotions": [
    { "code": "DISC5PER", "promo": "5% less" },
    { "code": "FREESHIP", "promo": "Free shipping" }
  ],
  "judasAlbums": [
    {
      "id": "j13",
      "name": "RockaRolla",
      "img": "img/judas/rockarolla.jpg",
      "price": 5,
      "stock": 10,
      "release": 1974
    },
    {
      "id": "j14",
      "name": "Sad wings of destiny",
      "img": "img/judas/sadwingsofdestiny.jpg",
      "price": 10,
      "stock": 10,
      "release": 1976,
      "description": "Sad Wings of Destiny is the second studio album by English heavy metal band Judas Priest, released on 23 March 1976 by Gull Records. It is considered the album on which Judas Priest consolidated their sound and image, and songs from it such as 'Victim of Changes' and 'The Ripper' have since become live standards. It was the band's only album to feature drummer Alan Moore. \n \n Noted for its riff-driven sound and the wide range of Rob Halford's lead vocals, the album displays a wide variety of styles, moods and textures, inspired by an array of groups such as Queen, Led Zeppelin, Deep Purple and Black Sabbath. The centrepiece 'Victim of Changes' is a nearly eight-minute track featuring heavy riffing trading off with high-pitched vocals, extended guitar leads, and a slow, moody breakdown toward the end. 'Tyrant' and 'The Ripper' are short, dense, high-powered rockers with many parts and changes. Riffs and solos dominate 'Genocide', 'Island of Domination', and 'Deceiver', and the band finds more laid-back moments in the crooning piano-backed 'Epitaph' and the moody 'Dreamer Deceiver'."
    },
    {
      "id": "j16",
      "name": "Sin after sin",
      "img": "img/judas/sinaftersin.jpg",
      "price": 7,
      "stock": 10,
      "release": 1977
    },
    {
      "id": "j7",
      "name": "Killing machine",
      "img": "img/judas/killingmachine.jpg",
      "price": 7,
      "stock": 10,
      "release": 1978
    },
    {
      "id": "j17",
      "name": "Stained class",
      "img": "img/judas/stainedclass.jpg",
      "price": 8,
      "stock": 10,
      "release": 1978
    },
    {
      "id": "j2",
      "name": "British steel",
      "img": "img/judas/britishsteel.jpg",
      "price": 10,
      "stock": 10,
      "release": 1980
    },
    {
      "id": "j10",
      "name": "Point of entry",
      "img": "img/judas/pointofentry.jpg",
      "price": 9,
      "stock": 10,
      "release": 1981
    },
    {
      "id": "j15",
      "name": "Screaming for vengeance",
      "img": "img/judas/screamingforvengeance.jpg",
      "price": 8,
      "stock": 10,
      "release": 1982
    },
    {
      "id": "j3",
      "name": "Defenders of the faith",
      "img": "img/judas/defendersofthefaith.jpg",
      "price": 10,
      "stock": 10,
      "release": 1984
    },
    {
      "id": "j18",
      "name": "Turbo",
      "img": "img/judas/turbo.jpg",
      "price": 8,
      "stock": 10,
      "release": 1986
    },
    {
      "id": "j11",
      "name": "Ram it down",
      "img": "img/judas/ramitdown.jpg",
      "price": 6,
      "stock": 10,
      "release": 1988
    },
    {
      "id": "j9",
      "name": "PainKiller",
      "img": "img/judas/painkiller.jpg",
      "price": 10,
      "stock": 10,
      "release": 1990
    },
    {
      "id": "j6",
      "name": "Jugulator",
      "img": "img/judas/jugulator.jpg",
      "price": 5,
      "stock": 10,
      "release": 1997
    },
    {
      "id": "j4",
      "name": "Demolition",
      "img": "img/judas/demolition.jpg",
      "price": 5,
      "stock": 10,
      "release": 2001
    },
    {
      "id": "j1",
      "name": "Angel of Retribution",
      "img": "img/judas/angelofretribution.jpg",
      "price": 9,
      "stock": 10,
      "release": 2005,
      "description": "Angel of Retribution is the fifteenth studio album by English heavy metal band Judas Priest, released in 2005. It is the band's first album since 1990's Painkiller to feature Rob Halford. The album debuted at No. 13 on the US Billboard 200 chart, which makes it the fourth highest charting Judas Priest album in the US. The album was produced by Roy Z, who co-wrote the song 'Deal with the Devil'. It won a 2005 Metal Hammer award for Best Album. In the 2005 Burrn! magazine Readers' Pop Poll, it was voted Best Album of the Year and Best Album Cover."
    },
    {
      "id": "j8",
      "name": "Nostradamus",
      "img": "img/judas/nostradamus.jpg",
      "price": 6,
      "stock": 10,
      "release": 2008
    },
    {
      "id": "j12",
      "name": "Redeemer of souls",
      "img": "img/judas/redeemerofsouls.jpg",
      "price": 10,
      "stock": 10,
      "release": 2014
    },
    {
      "id": "j5",
      "name": "Firepower",
      "img": "img/judas/firepower.jpg",
      "price": 12,
      "stock": 10,
      "release": 2018,
      "description": "Firepower is the eighteenth studio album by English heavy metal band Judas Priest. Released in 2018, it is the band's first studio album since 1988's 'Ram It Down' to be produced by Tom Allom and the first one with Andy Sneap as co-producer. The album sold around 49,000 copies in the United States within its first week of release, debuting at No. 5 on the 'Billboard 200' chart, making it the band's highest-charting album in the US. The album also reached No. 5 in the UK, making it their first top-ten album in the UK since British Steel. Music videos were made for 'Lightning Strike', 'Spectre' and 'No Surrender'.",
      "video": "https://www.youtube.com/embed/6QtjdDiMLVg"
    }

  ],
  "grimnerAlbums": [
    {
      "id": "g2",
      "name": "Färd",
      "img": "img/grimner/fard.jpg",
      "price": 6,
      "stock": 10,
      "release": 2012
    },
    {
      "id": "g1",
      "name": "Blodshymner",
      "img": "img/grimner/blodshymner.jpg",
      "price": 7,
      "stock": 10,
      "release": 2014
    },
    {
      "id": "g3",
      "name": "Frost Mot Eld",
      "img": "img/grimner/frostmoteld.jpg",
      "price": 8,
      "stock": 10,
      "release": 1016
    },
    {
      "id": "g4",
      "name": "Vanadrottning",
      "img": "img/grimner/vanadrottning.jpg",
      "price": 8,
      "stock": 10,
      "release": 2018
    },
    {
      "id": "g5",
      "name": "Urfader",
      "img": "img/grimner/urfader.jpg",
      "price": 9,
      "stock": 10,
      "release": 2022,
      "description": "Fourth album of the Swedish folk metallers from GRIMNER. \n\nWeaving their roots and influences from Swedish death metal and their love for heavy and power metal with enchanting folk melodies and pagan choirs, they once again create their unique sound - sung, as always, in their native language, Swedish. The crisp and fresh new sound of this album makes you realize what Grimner is all about. Thrashy guitar riffs, a mix of powerful clean and harsh vocals, pounding drums mixed with beautiful and distinct flutes and other folk instruments create an atmosphere that fits the stories of the old Norse gods and folklore alike.",
      "video": "https://www.youtube.com/embed/cn_07WoujNQ"
    }
  ],
  "finntrollAlbums": [
    {
      "id": "f1",
      "name": "Midnattens Widunder",
      "img": "img/finntroll/midnattens_widunder.jpg",
      "price": 5,
      "stock": 10,
      "release": 1999
    },
    {
      "id": "f2",
      "name": "Jaktens Tid",
      "img": "img/finntroll/jaktens_tid.jpg",
      "price": 6,
      "stock": 10,
      "release": 2001
    },
    {
      "id": "f4",
      "name": "Nattfödd",
      "img": "img/finntroll/nattfodd.jpg",
      "price": 7,
      "stock": 10,
      "release": 2004
    },
    {
      "id": "f3",
      "name": "Visor Om Slutet",
      "img": "img/finntroll/visor_om_slutet.jpg",
      "price": 6,
      "stock": 10,
      "release": 2006
    },
    {
      "id": "f5",
      "name": "Ur Jordens Djup",
      "img": "img/finntroll/ur_jordens_djup.jpg",
      "price": 7,
      "stock": 10,
      "release": 2006
    },
    {
      "id": "f6",
      "name": "Nifelvind",
      "img": "img/finntroll/nifelvind.jpg",
      "price": 9,
      "stock": 10,
      "release": 2010
    },
    {
      "id": "f7",
      "name": "Blodsvept",
      "img": "img/finntroll/blodsvept.png",
      "price": 9,
      "stock": 10,
      "release": 2013
    },
    {
      "id": "f8",
      "name": "Vredesvävd",
      "img": "img/finntroll/vredesvavd.jpg",
      "price": 12,
      "stock": 10,
      "release": 2020,
      "description": "Finnish folk metal heroes Finntroll return after 7 long years with their latest album “Vredesvävd” which translated to English means “Wrath-woven,” which captures the spirit of the band within the 10 tracks on offer. The band says, “After seven years of hiding, ‘Ormfolk’ slithers its way to bring the human race a prelude of the forthcoming chaos which even global pandemics are unable to prevent. Catchy melodies, furious speed and the rabid black humppa will ensure that your ears will be hissing for a long time!” We sink our teeth into some new Finntroll.",
      "video": "https://www.youtube.com/embed/3clNSvQW72Q"
    }
  ],
  "amonAmarthAlbums": [
    {
      "id": "aa1",
      "name": "Once Sent from the Golden Hall",
      "img": "img/amon/onceSentFromTheGoldenHall.jpg",
      "price": 5,
      "stock": 10,
      "release": 1998
    },
    {
      "id": "aa2",
      "name": "The Avenger",
      "img": "img/amon/theAvenger.jpg",
      "price": 5,
      "stock": 10,
      "release": 1999
    },
    {
      "id": "aa3",
      "name": "The Crusher",
      "img": "img/amon/theCrusher.jpg",
      "price": 5,
      "stock": 10,
      "release": 2001
    },
    {
      "id": "aa4",
      "name": "Versus the World",
      "img": "img/amon/versusTheWorld.jpg",
      "price": 7,
      "stock": 10,
      "release": 2002
    },
    {
      "id": "aa5",
      "name": "Fate of Norns",
      "img": "img/amon/fateOfTheNorns.jpg",
      "price": 7,
      "stock": 10,
      "release": 2004
    },
    {
      "id": "aa6",
      "name": "With Oden on Our Side",
      "img": "img/amon/withOdenOnOurSide.jpg",
      "price": 8,
      "stock": 10,
      "release": 2006
    },
    {
      "id": "aa7",
      "name": "Twilight of the Thunder God",
      "img": "img/amon/twilightOfTheThunderGod.jpg",
      "price": 11,
      "stock": 10,
      "release": 2008
    },
    {
      "id": "aa8",
      "name": "Surtur Rising",
      "img": "img/amon/surturRising.jpg",
      "price": 9,
      "stock": 10,
      "release": 2011
    },
    {
      "id": "aa9",
      "name": "Deceiver of the Gods",
      "img": "img/amon/deceiverOfTheGods.jpg",
      "price": 10,
      "stock": 10,
      "release": 2013
    },
    {
      "id": "aa10",
      "name": "Jomsviking",
      "img": "img/amon/jomsviking.jpg",
      "price": 12,
      "stock": 10,
      "release": 2016
    },
    {
      "id": "aa11",
      "name": "Berserker",
      "img": "img/amon/berserker.jpg",
      "price": 13,
      "stock": 10,
      "release": 2019
    },
    {
      "id": "aa12",
      "name": "The Great Heathen Army",
      "img": "img/amon/theGreatHeathenArmy.jpg",
      "price": 15,
      "stock": 10,
      "release": 2022,
      "description": "Armed with their 12th and arguably finest album to date, Amon Amarth are poised to return to full action with a bloody, broadsword-wielding vengeance. The release of The Great Heathen Army will kick-start another relentless global campaign, commencing with a co-headlining tour of Europe alongside Machine Head and fellow countrymen The Halo Effect. Still ruthlessly devoted to the ways of the warrior, Amon Amarth have Odin's wind in their sails like never before. From their underground smash debut Once Sent From The Golden Hall (1998) onwards, Amon Amarth have been an unstoppable creative force. With a unique and unmistakable sound that combines the best of several epic strains of metal, the quintet have become renowned for their ageless anthems and explosive, theatrical live shows. Albums like 2008's widely acclaimed Twilight Of The Thunder God and 2016's conceptual triumph Jomsviking, the Swedes have been consistent standard bearers for heavy metal as a life-affirming and communal experience, armed with a seemingly endless stream of instant classic songs. Now reaping the rewards of all those years of hard work, Amon Amarth are now regarded as one of the metal world's most vital and imperious live acts. From headlining festivals across Europe to claiming a place on Slayer's final tour of the US in 2019, they have honoured the adventurous ethos of their Viking forebears by taking their music anywhere and everywhere.",
      "video": "https://www.youtube.com/embed/QNrDGG87xho"
    }
  ],
  "bandsData": [
    {
      "id": 1,
      "name": "Judas Priest",
      "img": "img/judas_priest.jpg",
      "data": "judasAlbums",
      "description": "One of the most influential heavy metal groups of all time, Judas Priest emerged at the dawn of the New Wave of British Heavy Metal. Decked out in leather and chains, the band combined the gothic doom of Black Sabbath and blazing speed of Led Zeppelin with the inventive art rock of Queen, powered by the dynamic banshee wail of Rob Halford and the vicious dual lead guitar attack of Glenn Tipton and K.K. Downing. Judas Priest set the pace for the genre from 1975 until 1985 with iconic albums like British Steel (1980), Screaming for Vengeance (1982), and Defenders of the Faith (1984) and helped lay the groundwork for speed and death metal. The group struggled after Rob Halford's departure in the early '90s but were restored to prominence in the 2000s upon his return, issuing a string of acclaimed efforts -- Angel of Retribution (2005), Nostradamus (2010), Redeemer of Souls (2014), and Firepower (2018) -- that skillfully married melody, pageantry, and muscle."
    },
    {
      "id": 2,
      "name": "Grimner",
      "img": "img/grimner.jpg",
      "data": "grimnerAlbums",
      "description": "Grimner, founded in 2008, shows that the past few years of silence and pandemics hasn't been for nothing - silence means working. In the wake of a plague, Grimner emerge battle-scarred to release new tunes and tales to the world, inspired as always by ancient nordic myths and history. At the same time, this album certainly brings something special to the genre."
    },
    {
      "id": 3,
      "name": "Finntroll",
      "img": "img/finntroll.jpg",
      "data": "finntrollAlbums",
      "description": "Regarded as pioneers of the folk-metal movement, Finntroll emerged in the late 1990s with a sound that combined the extreme elements of death metal with traditional Finnish folk melodies. In the 2000s and beyond, the band found international success with albums like Ur Jordens Djup (2007), Blodsvept (2013), and Vredesvävd (2020), which saw them move deeper into the realm of ancient music, incorporating joik (a shamanistic chant that is believed to be one of the oldest-known musical forms in Northern Europe) into their death metal maelstrom."
    },
    {
      "id": 4,
      "name": "Amon Amarth",
      "img": "img/amon_amarth.jpg",
      "data": "amonAmarthAlbums",
      "description": "Formed in 1992, Amon Amarth became modern metal greats the hard way. The Swedes steadily built a formidable reputation as a ferocious live band and, as the years passed, were increasingly recognised for their recorded achievements. Breakthrough releases like 2006’s With Oden On Our Side and 2008’s Twilight Of The Thunder God, cemented their popularity throughout the metal world. Jomsviking (2015) hit the #1 spot in Germany’s official album chart and swiftly became their most successful worldwide release to date. Amon Amarth return to action in 2019, with their biggest, boldest and most bombastic musical statement to date. Amon Amarth – completed by vocalist Johan Hegg, guitarists Olavi Mikkonen and Johan Söderberg, bassist Ted Lundström and drummer Jocke Wallgren - know that expectations for their next move are at an all-time high. The excellent news is that the band’s 11th studio album, the aptly-named Berserker, is guaranteed to have all discerning metal fans punching the air with joy. Today, Amon Amarth stand tall and unassailable: over 25 years into a career that has seen them evolve from humble origins in the dark, dank rehearsal rooms of their native Tumba to their current status as explosive festival headliners and one of the metal world’s most widely adored bands."
    }
  ],
  "users": [
    {
      "username": "admin",
      "password": "123456",
      "passwordCheck": "123456",
      "fullName": "Alejandro L. Herrero",
      "email": "admin@admin.com",
      "country": "Spain",
      "address": "Fake Street 123",
      "postalCode": "12345",
      "phone": "666123456",
      "id": 0,
      "newsletter": false
    },
    {
      "username": "user1",
      "email": "user1@user.com",
      "password": "123456",
      "passwordCheck": "123456",
      "fullName": "John Doe",
      "country": "United States",
      "address": "Street userstreet 1",
      "postalCode": "11111",
      "phone": "699123456",
      "id": 1,
      "newsletter": false
    }
  ]
}
